Config/Catalogs/PaymentMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>PaymentMethods</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DescriptionTranslations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BookByCashRegister</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PrintCheque</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PrintNonFiscalCheque</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChequesArePrintedAtExternalCashRegister</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NonFiscalChequeTemplate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ElectronicChequeOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsByCash</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsByCreditCard</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AuthorizationCodeIsRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReferenceCodeIsRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsByBankTransfer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsByBonuses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsByGiftCertificate</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForReturnOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForExtraServiceFolioOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsViaInternetAcquiring</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsCloseToTheRoom</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsCloseToTheFolio</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForDeposits</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalBankTerminalIsUsed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashRegisterChequeCloseType</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChequePaymentMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ChequePaymentModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CreditCardTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MinimumBonuses</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashRegisterCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SMSTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DeliveryTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotExportToTheAccountingSystem</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalSystem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalSystemInteractions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsForResortFee</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeServicesInAdvance</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NoAdvances</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/DeliveryTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>DeliveryTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EMail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Both</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DoNotSend</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unisender</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/PaymentMethods/Forms/tcItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// -----------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Property("AvtoTest") Then
		If Parameters.AvtoTest Then
			Return;
		EndIf;	
	EndIf;
	// Settlement
	If Object.Ref = Catalogs.PaymentMethods.Settlement Then
		If Not Object.IsByBankTransfer Then
			Object.IsByBankTransfer = True;
			ThisObject.Modified = True;
		EndIf;
	EndIf;
	// Let's set the properties of the form
	tcProtection.SetFormProperties(ThisObject);
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure OnOpen(Cancel)
	VisibilityManaging();
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure DescriptionTranslationsOpening(pItem, pStandardProcessing)
	pStandardProcessing = False;
	OpenForm("Catalog.Languages.Form.tcEditForm", New Structure("Text", Object.DescriptionTranslations), pItem);	
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure BookByCashRegisterOnChange(Item)
	VisibilityManaging();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsByCashOnChange(Item)
	If Object.IsByCash Then
		If Object.IsViaInternetAcquiring Then
			Object.IsViaInternetAcquiring = False;
		EndIf;
		If Object.IsByCreditCard Then
			Object.IsByCreditCard = False;
		EndIf;
		If Object.IsByBankTransfer Then
			Object.IsByBankTransfer = False;
		EndIf;
		If Object.IsByBonuses Then
			Object.IsByBonuses = False;
		EndIf;
		If Object.IsByGiftCertificate Then
			Object.IsByGiftCertificate = False;
		EndIf;
		If Object.IsCloseToTheRoom Then
			Object.IsCloseToTheRoom = False;
		EndIf;
		If Object.IsCloseToTheFolio Then
			Object.IsCloseToTheFolio = False;
		EndIf;
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsViaInternetAcquiringOnChange(Item)
	If Object.IsViaInternetAcquiring Then
		If Object.IsByCash Then
			Object.IsByCash = False;
		EndIf;
		If Object.IsByCreditCard Then
			Object.IsByCreditCard = False;
		EndIf;
		If Object.IsByBankTransfer Then
			Object.IsByBankTransfer = False;
		EndIf;
		If Object.IsByBonuses Then
			Object.IsByBonuses = False;
		EndIf;
		If Object.IsByGiftCertificate Then
			Object.IsByGiftCertificate = False;
		EndIf;
		If Object.IsCloseToTheRoom Then
			Object.IsCloseToTheRoom = False;
		EndIf;
		If Object.IsCloseToTheFolio Then
			Object.IsCloseToTheFolio = False;
		EndIf;
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsByCreditCardOnChange(Item)
	If Object.IsByCreditCard Then
		If Object.IsByCash Then
			Object.IsByCash = False;
		EndIf;
		If Object.IsViaInternetAcquiring Then
			Object.IsViaInternetAcquiring = False;
		EndIf;
		If Object.IsByBankTransfer Then
			Object.IsByBankTransfer = False;
		EndIf;
		If Object.IsByBonuses Then
			Object.IsByBonuses = False;
		EndIf;
		If Object.IsByGiftCertificate Then
			Object.IsByGiftCertificate = False;
		EndIf;
		If Object.IsCloseToTheRoom Then
			Object.IsCloseToTheRoom = False;
		EndIf;
		If Object.IsCloseToTheFolio Then
			Object.IsCloseToTheFolio = False;
		EndIf;
	EndIf;
	VisibilityManaging();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsByBankTransferOnChange(Item)
	If Object.IsByBankTransfer Then
		If Object.IsByCash Then
			Object.IsByCash = False;
		EndIf;
		If Object.IsViaInternetAcquiring Then
			Object.IsViaInternetAcquiring = False;
		EndIf;
		If Object.IsByCreditCard Then
			Object.IsByCreditCard = False;
		EndIf;
		If Object.IsByBonuses Then
			Object.IsByBonuses = False;
		EndIf;
		If Object.IsByGiftCertificate Then
			Object.IsByGiftCertificate = False;
		EndIf;
		If Object.IsCloseToTheRoom Then
			Object.IsCloseToTheRoom = False;
		EndIf;
		If Object.IsCloseToTheFolio Then
			Object.IsCloseToTheFolio = False;
		EndIf;
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsByBonusesOnChange(Item)
	If Object.IsByBonuses Then
		If Object.IsByCash Then
			Object.IsByCash = False;
		EndIf;
		If Object.IsViaInternetAcquiring Then
			Object.IsViaInternetAcquiring = False;
		EndIf;
		If Object.IsByCreditCard Then
			Object.IsByCreditCard = False;
		EndIf;
		If Object.IsByBankTransfer Then
			Object.IsByBankTransfer = False;
		EndIf;
		If Object.IsByGiftCertificate Then
			Object.IsByGiftCertificate = False;
		EndIf;
		If Object.IsCloseToTheRoom Then
			Object.IsCloseToTheRoom = False;
		EndIf;
		If Object.IsCloseToTheFolio Then
			Object.IsCloseToTheFolio = False;
		EndIf;
	EndIf;
	VisibilityManaging();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsCloseToTheFolioOnChange(Item)
	If Object.IsCloseToTheFolio Then
		If Object.IsByCash Then
			Object.IsByCash = False;
		EndIf;
		If Object.IsViaInternetAcquiring Then
			Object.IsViaInternetAcquiring = False;
		EndIf;
		If Object.IsByCreditCard Then
			Object.IsByCreditCard = False;
		EndIf;
		If Object.IsByBankTransfer Then
			Object.IsByBankTransfer = False;
		EndIf;
		If Object.IsByBonuses Then
			Object.IsByBonuses = False;
		EndIf;
		If Object.IsByGiftCertificate Then
			Object.IsByGiftCertificate = False;
		EndIf;
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsForExtraServiceFolioOnlyOnChange(Item)
	VisibilityManaging();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsCloseToTheRoomOnChange(Item)
	If Object.IsCloseToTheRoom Then
		If Object.IsByCash Then
			Object.IsByCash = False;
		EndIf;
		If Object.IsViaInternetAcquiring Then
			Object.IsViaInternetAcquiring = False;
		EndIf;
		If Object.IsByCreditCard Then
			Object.IsByCreditCard = False;
		EndIf;
		If Object.IsByBankTransfer Then
			Object.IsByBankTransfer = False;
		EndIf;
		If Object.IsByBonuses Then
			Object.IsByBonuses = False;
		EndIf;
		If Object.IsByGiftCertificate Then
			Object.IsByGiftCertificate = False;
		EndIf;
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure IsByGiftCertificateOnChange(Item)
	If Object.IsByGiftCertificate Then
		If Object.IsByCash Then
			Object.IsByCash = False;
		EndIf;
		If Object.IsViaInternetAcquiring Then
			Object.IsViaInternetAcquiring = False;
		EndIf;
		If Object.IsByCreditCard Then
			Object.IsByCreditCard = False;
		EndIf;
		If Object.IsByBankTransfer Then
			Object.IsByBankTransfer = False;
		EndIf;
		If Object.IsByBonuses Then
			Object.IsByBonuses = False;
		EndIf;
		If Object.IsCloseToTheRoom Then
			Object.IsCloseToTheRoom = False;
		EndIf;
		If Object.IsCloseToTheFolio Then
			Object.IsCloseToTheFolio = False;
		EndIf;
	EndIf;
	VisibilityManaging();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure DeliveryTypeOnChange(Item)
	If Object.DeliveryType = PredefinedValue("Enum.DeliveryTypes.Unisender") Then
		Object.DeliveryType = Undefined;
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure CashRegisterChequeCloseTypeOnChange(Item)
	VisibilityManaging();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure PrintChequeOnChange(Item)
	If Object.PrintCheque Then
		Object.ChequesArePrintedAtExternalCashRegister = False;
	EndIf;
	VisibilityManaging();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure ChequesArePrintedAtExternalCashRegisterOnChange(pItem)
	If Object.ChequesArePrintedAtExternalCashRegister Then
		Object.PrintCheque = False;
	EndIf;
	VisibilityManaging();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure ExternalSystemOnChange(pItem)
	FillDiscountTypeByExternalSystem();
EndProcedure

// -----------------------------------------------------------------------------
&AtServer
Procedure FillDiscountTypeByExternalSystem()
	Object.DiscountType = Catalogs.DiscountTypes.EmptyRef();
	Try
		If ValueIsFilled(Object.ExternalSystem) Then
			Object.DiscountType = Object.ExternalSystem.DiscountType;	
		EndIf;
	Except
		Object.DiscountType = Catalogs.DiscountTypes.EmptyRef();
	EndTry;
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure FillChequeTemplate(Command)
	vTemplate = TrimAll(Object.NonFiscalChequeTemplate);
	If IsBlankString(vTemplate) Then
		vTemplate = 
		"&Document
		|&CurrentDate &CurrentTime
		|&Hotel
		|&Cashier
		|&FolioHeader
		|&Type
		|Сумма с НДС &VATRate = &Amount
		|--------------------------------------------------------------------------------
		|
		|Подпись: _____________________
		|
		|&Cliche";
	EndIf;
	
	ShowInputString(New NotifyDescription("AfterFillChequeTemplate", ThisObject), vTemplate, NStr("en='Input cheque template'; ru='Введите шаблон чека'; de='Kassenbon template'"), 0, True);
EndProcedure

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
&AtClient
Procedure  AfterFillChequeTemplate(pAnswer, pAddParams) Export 
	If Not pAnswer = Undefined And ValueIsFilled(pAnswer) Then
		Object.NonFiscalChequeTemplate = TrimAll(pAnswer);
	EndIf;	
EndProcedure	

// -----------------------------------------------------------------------------
&AtClient
Procedure VisibilityManaging()
	If Object.IsByBonuses Then
		Items.GroupBonusesRule.Enabled = True;
	Else
		Items.GroupBonusesRule.Enabled = False;
		If ValueIsFilled(Object.DiscountType) Then
			Object.DiscountType = PredefinedValue("Catalog.DiscountTypes.EmptyRef");
		EndIf;
	EndIf;
	If Object.BookByCashRegister Then
		Items.PrintCheque.Enabled = True;
		Items.CashRegisterCode.Enabled = True;
		If Object.PrintCheque Then
			Items.CashRegisterChequeCloseType.Enabled = True;
			Items.ElectronicChequeOnly.Enabled = True;
			Items.ChequePaymentMode.Enabled = True;
			Items.PrintNonFiscalCheque.Enabled = True;
			Items.ChequesArePrintedAtExternalCashRegister.Enabled = False;
			If Object.ChequesArePrintedAtExternalCashRegister Then
				Object.ChequesArePrintedAtExternalCashRegister = False;
			EndIf;
		Else
			Items.CashRegisterChequeCloseType.Enabled = False;
			Items.ElectronicChequeOnly.Enabled = False;
			If Object.ElectronicChequeOnly Then
				Object.ElectronicChequeOnly = False;
			EndIf;
			Items.ChequePaymentMode.Enabled = False;
			Items.PrintNonFiscalCheque.Enabled = False;
			If Object.PrintNonFiscalCheque Then
				Object.PrintNonFiscalCheque = False;
			EndIf;
			Items.ChequesArePrintedAtExternalCashRegister.Enabled = True;
		EndIf;
	Else
		Items.PrintCheque.Enabled = False;
		If Object.PrintCheque Then
			Object.PrintCheque = False;
		EndIf;
		Items.CashRegisterChequeCloseType.Enabled = False;
		Items.ElectronicChequeOnly.Enabled = False;
		If Object.ElectronicChequeOnly Then
			Object.ElectronicChequeOnly = False;
		EndIf;
		Items.ChequePaymentMode.Enabled = False;
		Items.PrintNonFiscalCheque.Enabled = False;
		If Object.PrintNonFiscalCheque Then
			Object.PrintNonFiscalCheque = False;
		EndIf;
		Items.FillChequeTemplate.Enabled = False;
		Items.CashRegisterCode.Enabled = False;
		If Object.CashRegisterCode <> 0 Then
			Object.CashRegisterCode = 0;
		EndIf;
		Items.ChequesArePrintedAtExternalCashRegister.Enabled = True;
	EndIf;
	If Object.ChequesArePrintedAtExternalCashRegister Then
		Items.ChequesArePrintedAtExternalCashRegister.Enabled = True;
		Items.PrintCheque.Enabled = False;
		If Object.PrintCheque Then
			Object.PrintCheque = False;
		EndIf;
		Items.CashRegisterChequeCloseType.Enabled = False;
		Items.ElectronicChequeOnly.Enabled = False;
		If Object.ElectronicChequeOnly Then
			Object.ElectronicChequeOnly = False;
		EndIf;
		Items.ChequePaymentMode.Enabled = False;
		Items.PrintNonFiscalCheque.Enabled = False;
		If Object.PrintNonFiscalCheque Then
			Object.PrintNonFiscalCheque = False;
		EndIf;
	EndIf;
	If Object.IsByCreditCard Then
		Items.ExternalBankTerminalIsUsed.Enabled = True;
		Items.ReferenceCodeIsRequired.Enabled = True;
		Items.AuthorizationCodeIsRequired.Enabled = True;
		Items.CardType.Enabled = True;
		Items.CardOwner.Enabled = True;
	Else
		Items.ExternalBankTerminalIsUsed.Enabled = False;
		Items.ReferenceCodeIsRequired.Enabled = False;
		Items.AuthorizationCodeIsRequired.Enabled = False;
		Items.CardType.Enabled = False;
		Items.CardOwner.Enabled = False;
	EndIf;
	If Object.IsByBonuses Or Object.IsByGiftCertificate Or Object.IsByCreditCard Then 
		Items.ExternalSystem.Enabled = True;
	Else
		Items.ExternalSystem.Enabled = False;
	EndIf;	
EndProcedure	

#EndRegion
